tap "alexnabokikh/tfsort", trusted: true
tap "go-swagger/go-swagger", trusted: true
tap "hashicorp/tap", trusted: true
tap "siderolabs/tap", trusted: true
tap "slp/krunkit", trusted: true
# C++ Common Libraries
brew "abseil"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Library for command-line editing
brew "readline"
# Mozilla CA certificate store
brew "ca-certificates"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Tool for interacting with remote images and registries
brew "crane"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# YAML Parser
brew "libyaml"
# Device tree compiler
brew "dtc"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source GitLab command-line tool
brew "glab"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Asynchronous event library
brew "libevent"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# HTTP/2 C Library
brew "libnghttp2"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Library for handling OpenGL function pointer management
brew "libepoxy", link: false
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Implementation of the Vulkan graphics and compute API on top of Metal
brew "molten-vk"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Port scanning utility for large networks
brew "nmap"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Command-line client for OpenStack
brew "openstackclient"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Sort Terraform files
brew "alexnabokikh/tfsort/tfsort"
# Terraform
brew "hashicorp/tap/terraform"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# A CLI tool to start Linux KVM or macOS Hypervisor framework virtual machines using the libkrun platform.
brew "slp/krunkit/krunkit"
# Terminal-based AI coding assistant
cask "claude-code"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Clipboard manager
cask "maccy"
# Open-source, self-hosted Slack-alternative
cask "mattermost"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Open-source software for live streaming and screen recording
cask "obs"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ibm.output-colorizer"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mekusuri.jsonl-tool"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.makefile-tools"
vscode "opentofu.vscode-opentofu"
vscode "puppet.puppet-vscode"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shuworks.vscode-table-formatter"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/josharian/impl"
go "landb"
go "github.com/deepmap/oapi-codegen/cmd/oapi-codegen"
go "github.com/prometheus/promu"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/terraform-docs/terraform-docs"
go "github.com/hashicorp/terraform-plugin-codegen-framework/cmd/tfplugingen-framework"
go "github.com/hashicorp/terraform-plugin-codegen-openapi/cmd/tfplugingen-openapi"
