tap "alexnabokikh/tfsort"
tap "esnet/gdg"
tap "go-swagger/go-swagger"
tap "hashicorp/tap"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "puppetlabs/puppet"
brew "abseil"
brew "libunistring"
brew "gettext"
brew "readline"
brew "ca-certificates"
brew "gmp"
brew "libyaml"
brew "openssl@3"
brew "checkov"
brew "colima"
brew "coreutils"
brew "findutils"
brew "pcre2"
brew "git"
brew "libevent"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "moreutils"
brew "opentofu"
brew "pinentry-mac"
brew "pipx"
brew "pre-commit"
brew "protobuf"
brew "ruby"
brew "terraform-docs"
brew "tflint"
brew "tree"
brew "wireguard-tools"
brew "yamllint"
brew "alexnabokikh/tfsort/tfsort"
brew "esnet/gdg/gdg"
brew "hashicorp/tap/terraform"
cask "discord"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "maccy"
cask "mattermost"
cask "obs"
cask "raspberry-pi-imager"
cask "shottr"
cask "spotify"
cask "stats"
cask "telegram"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ibm.output-colorizer"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "opentofu.vscode-opentofu"
vscode "redhat.vscode-yaml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "whizkydee.material-palenight-theme"
vscode "zignd.html-css-class-completion"
